package ru.top.employeeAccountingSystem;

public class Test {
    public static void main(String[] args) {
        /* Методы:

        - начало работы вход по логину и паролю
        есть база (мапа) с логинами и паролями,
        при входе требуем и проверяем

         - принимать на работу новых сотрудников
         метод, который создаёт новый объект класса работник и записывает в файл
        принимает данные. такие как фио, зарплата и пр поля

        - увольнять сотрудников
        метод удаляет сотрудника из файла и вообще

        - изменять информацию о сотрудниках
        метод спрашивает, у какого сотрудника надо что-то менять,
        что именно надо изменить и перезаписывает в файле

        - поиск и вывод сотрудников
        по фио, должности, отделу и начальнику

        - отчёт по структуре организации
        инфа об отделах и их начальниках

        - отчётпо средней зарплате
         по организации и по отделам

        - топ10 самых дорогих сотрудников по зарплате
        сотрировка по зарплате

        - топ10 самых преданных сутрудников
        по количеству лет в организации
        здесь будем вычитать даты

        Всё это читаем из файлов, отчёты пишем в файлы, поиск и вывод сотрудников показываем в консоли

         */








    }
}
